SELECT
	Пас.ФИО,
	Пас.Паспорт,
	Билеты.Рейс,
	Рейсы.Время_отправления AS Отправление,
	Билеты.Дата_вылета,
	Билеты.Номер_билета AS [№ билета],
	Билеты.Место,
	Рейсы.Пункт_назначения,
	Рейсы.Цена_билета AS [Цена,руб],
	Самолеты.Тип_самолета



FROM
	Пассажиры Пас
		INNER JOIN Билеты ON Пас.Пассажир_id = Билеты.Пассажир_id
		INNER JOIN Рейсы ON Билеты.Рейс = Рейсы.Рейс
		INNER JOIN Самолеты ON Рейсы.Код_самолета = Самолеты.Код_самолета


WHERE
	Билеты.Рейс = 'МСК-2' AND Билеты.Дата_вылета = '2025-01-02'


ORDER BY
	Билеты.Дата_вылета, Билеты.Место



