 
 SELECT
	Бил.Дата_вылета,
	Бил.Рейс,
	CONCAT(Airbus.Место, Boeing.Место) AS [Места без билетов]

FROM
	Билеты Бил
	INNER JOIN Рейсы ON Бил.Рейс = Рейсы.Рейс
	INNER JOIN Самолеты ON Рейсы.Код_самолета = Самолеты.Код_самолета
	LEFT JOIN Airbus ON Самолеты.Тип_самолета = Airbus.Тип_самолета
	LEFT JOIN Boeing ON Самолеты.Тип_самолета = Boeing.Тип_самолета
	LEFT JOIN Билеты Блт ON Бил.Дата_вылета = Блт.Дата_вылета AND Бил.Рейс = Блт.Рейс AND Блт.Место = Boeing.Место OR
	                        Бил.Дата_вылета = Блт.Дата_вылета AND Бил.Рейс = Блт.Рейс And Блт.Место = Airbus.Место

GROUP BY
	Бил.Дата_вылета, Бил.Рейс, Airbus.Место, Boeing.Место, Блт.Место

HAVING
	Блт.Место IS NULL